       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-COUNT PIC 9(3) VALUE 0.
       01 WS-NAME  PIC X(20) VALUE "WORLD".
       PROCEDURE DIVISION.
       MAIN-PARA.
           PERFORM VARYING WS-COUNT FROM 1 BY 1
               UNTIL WS-COUNT > 3
               DISPLAY "HELLO " WS-NAME
           END-PERFORM.
           STOP RUN.
